export type Dept = 'المالية' | 'الموارد البشرية';

export interface Conversion {
  name: string;
  ext: number;
  dept: Dept;
}

export const conversions: Conversion[] = [
  { name: "الاستقبال", ext: 10, dept: "المالية" },
  { name: "تي بوي امادات", ext: 11, dept: "المالية" },
  { name: "تي بوي الترا", ext: 15, dept: "المالية" },
  { name: "صهيب", ext: 17, dept: "المالية" },
  { name: "أ.خالد", ext: 100, dept: "المالية" },
  { name: "نواف", ext: 101, dept: "المالية" },
  { name: "تبي بوي مستر", ext: 102, dept: "المالية" },
  { name: "بدر", ext: 103, dept: "المالية" },
  { name: "محمد", ext: 104, dept: "المالية" },
  { name: "علي قدري", ext: 105, dept: "المالية" },
  { name: "احمد محمد حلمي", ext: 106, dept: "المالية" },
  { name: "التسويق", ext: 401, dept: "المالية" },
  { name: "احمد سمير", ext: 402, dept: "المالية" },
  { name: "صبري علي", ext: 700, dept: "المالية" },
  { name: "شريف السبكي", ext: 701, dept: "المالية" },
  { name: "صبري", ext: 702, dept: "المالية" },
  { name: "شعبان", ext: 703, dept: "المالية" },
  { name: "احمد غنيم", ext: 704, dept: "المالية" },
  { name: "الهنوف", ext: 705, dept: "المالية" },
  { name: "علي قدري", ext: 707, dept: "المالية" },

  { name: "منيره المانع", ext: 200, dept: "الموارد البشرية" },
  { name: "فلاح الدوسري", ext: 201, dept: "الموارد البشرية" },
  { name: "رنا زيادة", ext: 202, dept: "الموارد البشرية" },
  { name: "مشاعل القريني", ext: 203, dept: "الموارد البشرية" },
  { name: "احمد سعادة", ext: 204, dept: "الموارد البشرية" },
  { name: "عبدالرحمن المجبل", ext: 300, dept: "الموارد البشرية" },
  { name: "هشام المغربي", ext: 500, dept: "الموارد البشرية" },
  { name: "مشعل", ext: 501, dept: "الموارد البشرية" },
  { name: "عبدالعزيز القحطاني", ext: 502, dept: "الموارد البشرية" },
  { name: "عبدالله حمدي", ext: 503, dept: "الموارد البشرية" },
  { name: "شهادات", ext: 505, dept: "الموارد البشرية" },
  { name: "متعب", ext: 900, dept: "الموارد البشرية" },
  { name: "تشغيل الترا 1", ext: 12, dept: "الموارد البشرية" },
  { name: "تشغيل الترا 2", ext: 13, dept: "الموارد البشرية" },
  { name: "تشغيل الترا 3", ext: 14, dept: "الموارد البشرية" },
  { name: "خدمه العملاء الترا", ext: 16, dept: "الموارد البشرية" },
  { name: "منيره الترا", ext: 19, dept: "الموارد البشرية" },
  { name: "مدير تشغيل الترا", ext: 20, dept: "الموارد البشرية" }
];

export const RECEPTION_EXT = 10;
